## Staging: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 51 to add, 0 to change, 0 to destroy
```
**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/4798838401).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_subnet_ids.ecr_endpoint_available will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "ecr_endpoint_available" {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
            ]
        }
      + filter {
          + name   = "tag:Access"
          + values = [
              + "private",
            ]
        }
    }

  # data.aws_subnet_ids.lambda_endpoint_available will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "lambda_endpoint_available" {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
            ]
        }
      + filter {
          + name   = "tag:Access"
          + values = [
              + "private",
            ]
        }
    }

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "vpc_flow_logs"
      + retention_in_days = 30
      + tags              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_default_network_acl.forms will be created
  + resource "aws_default_network_acl" "forms" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 400
          + to_port    = 0
        }

      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 300
          + to_port    = 0
        }
      + ingress {
          + action     = "deny"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 22
          + protocol   = "tcp"
          + rule_no    = 100
          + to_port    = 22
        }
      + ingress {
          + action     = "deny"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 3389
          + protocol   = "tcp"
          + rule_no    = 200
          + to_port    = 3389
        }
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.forms_natgw[0] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 0"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_eip.forms_natgw[1] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 1"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 1"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_eip.forms_natgw[2] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 2"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW 2"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_flow_log.vpc_flow_logs will be created
  + resource "aws_flow_log" "vpc_flow_logs" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-687401027353/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_internet_gateway.forms will be created
  + resource "aws_internet_gateway" "forms" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.forms[0] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_nat_gateway.forms[1] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_nat_gateway.forms[2] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_route_table.forms_private_subnet[0] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 0"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 0"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_private_subnet[1] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 1"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 1"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_private_subnet[2] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 2"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Private Subnet Route Table 2"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_public_subnet will be created
  + resource "aws_route_table" "forms_public_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Public Subnet Route Table"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Name"       = "Public Subnet Route Table"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.forms[0] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms[1] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms[2] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[0] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[1] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[2] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.forms will be created
  + resource "aws_security_group" "forms" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "forms"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_database will be created
  + resource "aws_security_group" "forms_database" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms Database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "forms-database"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_egress will be created
  + resource "aws_security_group" "forms_egress" {
      + arn                    = (known after apply)
      + description            = "Egress - Forms External Services"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "egress-anywhere"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_load_balancer will be created
  + resource "aws_security_group" "forms_load_balancer" {
      + arn                    = (known after apply)
      + description            = "Ingress - forms Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "forms-load-balancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_redis will be created
  + resource "aws_security_group" "forms_redis" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "forms-redis"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.privatelink will be created
  + resource "aws_security_group" "privatelink" {
      + arn                    = (known after apply)
      + description            = "privatelink endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "privatelink"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.forms_egress_database will be created
  + resource "aws_security_group_rule" "forms_egress_database" {
      + description              = "Security group rule for Forms DB egress to Database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_egress_privatelink will be created
  + resource "aws_security_group_rule" "forms_egress_privatelink" {
      + description              = "Security group rule for Forms egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_egress_redis will be created
  + resource "aws_security_group_rule" "forms_egress_redis" {
      + description              = "Security group rule for Forms DB egress to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_external_auth will be created
  + resource "aws_security_group_rule" "forms_external_auth" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Security group rule for Forms app access to the internet for external authentication"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_ingress_alb will be created
  + resource "aws_security_group_rule" "forms_ingress_alb" {
      + description              = "Security group rule for Forms Ingress ALB"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # aws_security_group_rule.privatelink_forms_ingress will be created
  + resource "aws_security_group_rule" "privatelink_forms_ingress" {
      + description              = "Security group rule for Forms ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self       ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
